In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.DataFrame(np.arange(0,20).reshape(5,4),columns=["col1","col2","col3","col4"], index=["row1","row2","row3","row4","row5"])

In [3]:
data

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [15]:
#converting in to array
d1=data.iloc[:,:].values
d1

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [19]:
type(d1)

numpy.ndarray

In [5]:
data["col1"]

row1     0
row2     4
row3     8
row4    12
row5    16
Name: col1, dtype: int32

In [6]:
data.loc["row3"]

col1     8
col2     9
col3    10
col4    11
Name: row3, dtype: int32

In [7]:
data.iloc[0:2,1:3]

      col2  col3
row1     1     2
row2     5     6

In [8]:
data[["col1","col3"]]

      col1  col3
row1     0     2
row2     4     6
row3     8    10
row4    12    14
row5    16    18

In [10]:
data["col3"].unique()

array([ 2,  6, 10, 14, 18])

In [13]:
data["col3"].value_counts()

col3
2     1
6     1
10    1
14    1
18    1
Name: count, dtype: int64

In [22]:
df=pd.read_csv('cu.item.txt',sep='\t')
df

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359
...,...,...,...,...,...
395,SSEA011,College textbooks,3,T,314
396,SSEE041,Smartphones,4,T,335
397,SSFV031A,Food at elementary and secondary schools,3,T,122
398,SSGE013,Infants' equipment,3,T,356
399,SSHJ031,Infants' furniture,3,T,165